import { Leaf , Compo , ef , pl , DD , Focus , log } from "../../Meh/Meh.js" ;
import { Renn , Order as MehOrder , Key } from "../../Meh/Model/Marker.js" ;

namespace DM
{
	export type stat =
	{
		no : string ;
		name : string ;
		r1 : number ;
		r2 : number ;
		x : number ;
		y : number ;
	}

	export type stat_src = Omit < stat , "no" | "r1" | "r2" > ;

	export type Stat = Compo < stat > ;
	export type Order = MehOrder < Stat > ;
	

	export const stat = ( lc : line_cd , n : number , src : stat_src ) : DM.stat => ( { no : lc + "-" + ( n + 1 ) , r1 : rnd () , r2 : rnd ( 1000 ) , ... src } ) ;
	const rnd = ( v = 100 ) => Math.floor ( Math.random () * v ) ;



	export type line_src = { name : string , slist : stat_src [] } ;

	export const data : { [ r : string ] : line_src } =
	{
		SI : { name : "西武池袋線" , slist : [{"name":"池袋","x":139.711461,"y":35.72913},{"name":"椎名町","x":139.694363,"y":35.726572},{"name":"東長崎","x":139.683294,"y":35.73003},{"name":"江古田","x":139.672814,"y":35.737557},{"name":"桜台","x":139.662602,"y":35.738797},{"name":"練馬","x":139.654368,"y":35.737893},{"name":"中村橋","x":139.637456,"y":35.736767},{"name":"富士見台","x":139.62969,"y":35.735867},{"name":"練馬高野台","x":139.616749,"y":35.740622},{"name":"石神井公園","x":139.606981,"y":35.743563},{"name":"大泉学園","x":139.586732,"y":35.749406},{"name":"保谷","x":139.567753,"y":35.748222},{"name":"ひばりヶ丘","x":139.545852,"y":35.751485},{"name":"東久留米","x":139.533739,"y":35.760445},{"name":"清瀬","x":139.519917,"y":35.772221},{"name":"秋津","x":139.496539,"y":35.778614},{"name":"所沢","x":139.473324,"y":35.786627},{"name":"西所沢","x":139.455959,"y":35.789303},{"name":"小手指","x":139.438016,"y":35.800535},{"name":"狭山ヶ丘","x":139.416975,"y":35.810445},{"name":"武蔵藤沢","x":139.412736,"y":35.820963},{"name":"稲荷山公園","x":139.39842,"y":35.845112},{"name":"入間市","x":139.390294,"y":35.842904},{"name":"仏子","x":139.360115,"y":35.83769},{"name":"元加治","x":139.345316,"y":35.84058},{"name":"飯能","x":139.318824,"y":35.851189},{"name":"東飯能","x":139.325965,"y":35.852928},{"name":"高麗","x":139.304414,"y":35.881982},{"name":"武蔵横手","x":139.280667,"y":35.885256},{"name":"東吾野","x":139.260281,"y":35.892439},{"name":"吾野","x":139.226787,"y":35.908502}] } ,
		SS : { name : "西武新宿線" , slist : [{"name":"西武新宿","x":139.7,"y":35.696254},{"name":"高田馬場","x":139.703715,"y":35.712677},{"name":"下落合","x":139.695391,"y":35.715846},{"name":"中井","x":139.686967,"y":35.715106},{"name":"新井薬師前","x":139.672582,"y":35.715778},{"name":"沼袋","x":139.663841,"y":35.719458},{"name":"野方","x":139.652733,"y":35.719658},{"name":"都立家政","x":139.644839,"y":35.722313},{"name":"鷺ノ宮","x":139.63892,"y":35.722605},{"name":"下井草","x":139.624688,"y":35.723852},{"name":"井荻","x":139.615303,"y":35.72469},{"name":"上井草","x":139.602937,"y":35.725326},{"name":"上石神井","x":139.592266,"y":35.726189},{"name":"武蔵関","x":139.576417,"y":35.7276},{"name":"東伏見","x":139.563529,"y":35.728761},{"name":"西武柳沢","x":139.552477,"y":35.728621},{"name":"田無","x":139.539259,"y":35.727307},{"name":"花小金井","x":139.513228,"y":35.726129},{"name":"小平","x":139.488491,"y":35.736963},{"name":"久米川","x":139.472653,"y":35.749575},{"name":"東村山","x":139.465839,"y":35.76006},{"name":"所沢","x":139.473324,"y":35.786627},{"name":"航空公園","x":139.465641,"y":35.798272},{"name":"新所沢","x":139.457069,"y":35.805854},{"name":"入曽","x":139.427304,"y":35.832481},{"name":"狭山市","x":139.413015,"y":35.856936},{"name":"新狭山","x":139.433499,"y":35.873993},{"name":"南大塚","x":139.454189,"y":35.889663},{"name":"本川越","x":139.481125,"y":35.913524}] } ,
		JU : { name : "JR宇都宮線" , slist : [{"name":"上野","x":139.777043,"y":35.71379},{"name":"尾久","x":139.753846,"y":35.74683},{"name":"赤羽","x":139.720928,"y":35.778026},{"name":"浦和","x":139.657109,"y":35.858496},{"name":"さいたま新都心","x":139.633587,"y":35.893867},{"name":"大宮","x":139.62405,"y":35.906439},{"name":"土呂","x":139.63214,"y":35.931997},{"name":"東大宮","x":139.640291,"y":35.948751},{"name":"蓮田","x":139.653016,"y":35.981272},{"name":"白岡","x":139.666826,"y":36.01774},{"name":"新白岡","x":139.67208,"y":36.038732},{"name":"久喜","x":139.67727,"y":36.065684},{"name":"東鷲宮","x":139.67913,"y":36.089428},{"name":"栗橋","x":139.694177,"y":36.136852},{"name":"古河","x":139.709726,"y":36.194375},{"name":"野木","x":139.734729,"y":36.229963},{"name":"間々田","x":139.761039,"y":36.257908},{"name":"小山","x":139.806241,"y":36.312747},{"name":"小金井","x":139.842232,"y":36.374435},{"name":"自治医大","x":139.854524,"y":36.39543},{"name":"石橋","x":139.866536,"y":36.43651},{"name":"雀宮","x":139.876811,"y":36.493845},{"name":"宇都宮","x":139.898389,"y":36.559246},{"name":"岡本","x":139.944363,"y":36.598182},{"name":"宝積寺","x":139.979487,"y":36.631703},{"name":"氏家","x":139.9621,"y":36.681696},{"name":"蒲須坂","x":139.950461,"y":36.720727},{"name":"片岡","x":139.945665,"y":36.754557},{"name":"矢板","x":139.932912,"y":36.80655},{"name":"野崎","x":139.957752,"y":36.843722},{"name":"西那須野","x":139.986383,"y":36.883726},{"name":"那須塩原","x":140.020694,"y":36.931956},{"name":"黒磯","x":140.060204,"y":36.970128}] } ,
		Y  : { name : "有楽町線" , slist : [{"name":"和光市","x":139.612434,"y":35.788507},{"name":"地下鉄成増","x":139.631497,"y":35.776557},{"name":"地下鉄赤塚","x":139.644021,"y":35.769939},{"name":"平和台","x":139.653762,"y":35.757863},{"name":"氷川台","x":139.665567,"y":35.74955},{"name":"小竹向原","x":139.678572,"y":35.743803},{"name":"千川","x":139.689271,"y":35.738229},{"name":"要町","x":139.698715,"y":35.73323},{"name":"池袋","x":139.710088,"y":35.729565},{"name":"東池袋","x":139.719546,"y":35.725732},{"name":"護国寺","x":139.72754,"y":35.719044},{"name":"江戸川橋","x":139.733538,"y":35.709495},{"name":"飯田橋","x":139.743669,"y":35.701934},{"name":"市ヶ谷","x":139.73647,"y":35.691958},{"name":"麹町","x":139.737613,"y":35.684006},{"name":"永田町","x":139.740258,"y":35.678757},{"name":"桜田門","x":139.75149,"y":35.677405},{"name":"有楽町","x":139.763265,"y":35.675714},{"name":"銀座一丁目","x":139.767045,"y":35.67435},{"name":"新富町","x":139.773711,"y":35.670462},{"name":"月島","x":139.784233,"y":35.664871},{"name":"豊洲","x":139.79621,"y":35.654908},{"name":"辰巳","x":139.81052,"y":35.645576},{"name":"新木場","x":139.826254,"y":35.645832}] } ,
		TI : { name : "東武伊勢崎線" , slist : [{"name":"浅草","x":139.798214,"y":35.711883},{"name":"とうきょうスカイツリー","x":139.809332,"y":35.71043},{"name":"押上","x":139.812935,"y":35.710702},{"name":"曳舟","x":139.816634,"y":35.718418},{"name":"東向島","x":139.819306,"y":35.724324},{"name":"鐘ヶ淵","x":139.820344,"y":35.733712},{"name":"堀切","x":139.817727,"y":35.742977},{"name":"牛田","x":139.811816,"y":35.744555},{"name":"北千住","x":139.805564,"y":35.749891},{"name":"小菅","x":139.812935,"y":35.759039},{"name":"五反野","x":139.809643,"y":35.765852},{"name":"梅島","x":139.797916,"y":35.772437},{"name":"西新井","x":139.790372,"y":35.777323},{"name":"竹ノ塚","x":139.790788,"y":35.794368},{"name":"谷塚","x":139.801483,"y":35.814926},{"name":"草加","x":139.803397,"y":35.828476},{"name":"獨協大学前","x":139.800622,"y":35.84333},{"name":"新田","x":139.795391,"y":35.854086},{"name":"蒲生","x":139.791686,"y":35.866851},{"name":"新越谷","x":139.789905,"y":35.875186},{"name":"越谷","x":139.786213,"y":35.887529},{"name":"北越谷","x":139.780008,"y":35.901724},{"name":"大袋","x":139.777868,"y":35.92437},{"name":"せんげん台","x":139.774478,"y":35.935832},{"name":"武里","x":139.770675,"y":35.949102},{"name":"一ノ割","x":139.766219,"y":35.96412},{"name":"春日部","x":139.752345,"y":35.980095},{"name":"北春日部","x":139.744012,"y":35.990655},{"name":"姫宮","x":139.738674,"y":36.004384},{"name":"東武動物公園","x":139.726901,"y":36.024604},{"name":"和戸","x":139.701156,"y":36.039562},{"name":"久喜","x":139.67727,"y":36.065684},{"name":"鷲宮","x":139.656945,"y":36.09626},{"name":"花崎","x":139.633522,"y":36.109891},{"name":"加須","x":139.595584,"y":36.122992},{"name":"南羽生","x":139.55696,"y":36.14959},{"name":"羽生","x":139.533949,"y":36.170345},{"name":"川俣","x":139.52652,"y":36.208778},{"name":"茂林寺前","x":139.527058,"y":36.226331},{"name":"館林","x":139.527811,"y":36.246606},{"name":"多々良","x":139.500179,"y":36.273732},{"name":"県","x":139.472336,"y":36.290615},{"name":"福居","x":139.458634,"y":36.305208},{"name":"東武和泉","x":139.45509,"y":36.315595},{"name":"足利市","x":139.448113,"y":36.32948},{"name":"野州山辺","x":139.431981,"y":36.32633},{"name":"韮川","x":139.401704,"y":36.307913},{"name":"太田","x":139.378779,"y":36.294228},{"name":"細谷","x":139.348509,"y":36.282523},{"name":"木崎","x":139.312988,"y":36.271393},{"name":"世良田","x":139.282038,"y":36.272931},{"name":"境町","x":139.256177,"y":36.277191},{"name":"剛志","x":139.223792,"y":36.295428},{"name":"新伊勢崎","x":139.201816,"y":36.318052},{"name":"伊勢崎","x":139.194559,"y":36.326622}] } ,
		TJ : { name : "東武東上線" , slist : [{"name":"池袋","x":139.710678,"y":35.730924},{"name":"北池袋","x":139.716749,"y":35.741283},{"name":"下板橋","x":139.714785,"y":35.745721},{"name":"大山","x":139.702589,"y":35.748398},{"name":"中板橋","x":139.694628,"y":35.756214},{"name":"ときわ台","x":139.689015,"y":35.758771},{"name":"上板橋","x":139.67641,"y":35.763596},{"name":"東武練馬","x":139.661964,"y":35.768698},{"name":"下赤塚","x":139.644482,"y":35.770558},{"name":"成増","x":139.632708,"y":35.777723},{"name":"和光市","x":139.612434,"y":35.788507},{"name":"朝霞","x":139.600321,"y":35.796736},{"name":"朝霞台","x":139.587189,"y":35.814328},{"name":"志木","x":139.575367,"y":35.822105},{"name":"柳瀬川","x":139.562071,"y":35.830723},{"name":"みずほ台","x":139.55078,"y":35.838233},{"name":"鶴瀬","x":139.539347,"y":35.845776},{"name":"ふじみ野","x":139.523389,"y":35.860735},{"name":"上福岡","x":139.511782,"y":35.873855},{"name":"新河岸","x":139.497257,"y":35.890911},{"name":"川越","x":139.483078,"y":35.906742},{"name":"川越市","x":139.476989,"y":35.914146},{"name":"霞ヶ関","x":139.442897,"y":35.925635},{"name":"鶴ヶ島","x":139.423825,"y":35.936771},{"name":"若葉","x":139.408782,"y":35.948919},{"name":"坂戸","x":139.394032,"y":35.957181},{"name":"北坂戸","x":139.396932,"y":35.972098},{"name":"高坂","x":139.397747,"y":36.002572},{"name":"東松山","x":139.401651,"y":36.034608},{"name":"森林公園","x":139.374947,"y":36.045239},{"name":"つきのわ","x":139.345541,"y":36.04352},{"name":"武蔵嵐山","x":139.32829,"y":36.044001},{"name":"小川町","x":139.260412,"y":36.05903},{"name":"東武竹沢","x":139.237591,"y":36.0754},{"name":"みなみ寄居","x":139.236463,"y":36.091649},{"name":"男衾","x":139.234442,"y":36.107415},{"name":"鉢形","x":139.208649,"y":36.11378},{"name":"玉淀","x":139.200052,"y":36.117071},{"name":"寄居","x":139.194508,"y":36.117597}] } ,
		OH : { name : "小田急小田原線" , slist : [{"name":"新宿","x":139.699574,"y":35.691435},{"name":"南新宿","x":139.69867,"y":35.683483},{"name":"参宮橋","x":139.693568,"y":35.678586},{"name":"代々木八幡","x":139.688913,"y":35.669715},{"name":"代々木上原","x":139.680153,"y":35.669159},{"name":"東北沢","x":139.673014,"y":35.665379},{"name":"下北沢","x":139.667516,"y":35.661655},{"name":"世田谷代田","x":139.661557,"y":35.65834},{"name":"梅ヶ丘","x":139.653628,"y":35.656024},{"name":"豪徳寺","x":139.647381,"y":35.653807},{"name":"経堂","x":139.635993,"y":35.650991},{"name":"千歳船橋","x":139.624544,"y":35.647616},{"name":"祖師ヶ谷大蔵","x":139.609659,"y":35.643236},{"name":"成城学園前","x":139.598958,"y":35.640114},{"name":"喜多見","x":139.587445,"y":35.636697},{"name":"狛江","x":139.577127,"y":35.632001},{"name":"和泉多摩川","x":139.573695,"y":35.627349},{"name":"登戸","x":139.569449,"y":35.62115},{"name":"向ヶ丘遊園","x":139.564719,"y":35.617273},{"name":"生田","x":139.542024,"y":35.614954},{"name":"読売ランド前","x":139.527903,"y":35.614723},{"name":"百合ヶ丘","x":139.516121,"y":35.60903},{"name":"新百合ヶ丘","x":139.507608,"y":35.603705},{"name":"柿生","x":139.497614,"y":35.589597},{"name":"鶴川","x":139.481759,"y":35.583077},{"name":"玉川学園前","x":139.463388,"y":35.563486},{"name":"町田","x":139.445236,"y":35.544222},{"name":"相模大野","x":139.437836,"y":35.532208},{"name":"小田急相模原","x":139.422571,"y":35.515134},{"name":"相武台前","x":139.408509,"y":35.499294},{"name":"座間","x":139.399899,"y":35.480913},{"name":"海老名","x":139.390905,"y":35.452709},{"name":"厚木","x":139.377896,"y":35.443081},{"name":"本厚木","x":139.364261,"y":35.439338},{"name":"愛甲石田","x":139.344098,"y":35.417634},{"name":"伊勢原","x":139.313768,"y":35.396081},{"name":"鶴巻温泉","x":139.277813,"y":35.381131},{"name":"東海大学前","x":139.271236,"y":35.373151},{"name":"秦野","x":139.226009,"y":35.370075},{"name":"渋沢","x":139.184405,"y":35.374032},{"name":"新松田","x":139.139848,"y":35.345082},{"name":"開成","x":139.135785,"y":35.326532},{"name":"栢山","x":139.14258,"y":35.310679},{"name":"富水","x":139.145166,"y":35.296759},{"name":"螢田","x":139.152036,"y":35.285055},{"name":"足柄","x":139.15447,"y":35.271763},{"name":"小田原","x":139.155396,"y":35.256229}] } ,
		TY : { name : "東急東横線" , slist : [{"name":"渋谷","x":139.702417,"y":35.659545},{"name":"代官山","x":139.703284,"y":35.648193},{"name":"中目黒","x":139.698621,"y":35.643854},{"name":"祐天寺","x":139.690758,"y":35.637163},{"name":"学芸大学","x":139.68522,"y":35.628786},{"name":"都立大学","x":139.676393,"y":35.617835},{"name":"自由が丘","x":139.668664,"y":35.607224},{"name":"田園調布","x":139.667356,"y":35.596815},{"name":"多摩川","x":139.668723,"y":35.589591},{"name":"新丸子","x":139.661964,"y":35.58049},{"name":"武蔵小杉","x":139.659652,"y":35.575752},{"name":"元住吉","x":139.654668,"y":35.565698},{"name":"日吉","x":139.646944,"y":35.5539},{"name":"綱島","x":139.63491,"y":35.536906},{"name":"大倉山","x":139.629808,"y":35.52243},{"name":"菊名","x":139.63137,"y":35.509854},{"name":"妙蓮寺","x":139.633194,"y":35.498779},{"name":"白楽","x":139.627875,"y":35.489555},{"name":"東白楽","x":139.629364,"y":35.483523},{"name":"反町","x":139.625337,"y":35.47474},{"name":"横浜","x":139.622299,"y":35.466372}] } ,
		DT : { name : "東急田園都市線" , slist : [{"name":"渋谷","x":139.702148,"y":35.65802},{"name":"池尻大橋","x":139.684319,"y":35.650603},{"name":"三軒茶屋","x":139.670156,"y":35.643716},{"name":"駒沢大学","x":139.661702,"y":35.633471},{"name":"桜新町","x":139.644779,"y":35.631666},{"name":"用賀","x":139.633928,"y":35.626436},{"name":"二子玉川","x":139.626685,"y":35.611788},{"name":"二子新地","x":139.622338,"y":35.606994},{"name":"高津","x":139.616934,"y":35.603248},{"name":"溝の口","x":139.610487,"y":35.59984},{"name":"梶が谷","x":139.605885,"y":35.593963},{"name":"宮崎台","x":139.591313,"y":35.587228},{"name":"宮前平","x":139.581983,"y":35.584951},{"name":"鷺沼","x":139.573268,"y":35.579762},{"name":"たまプラーザ","x":139.558447,"y":35.577427},{"name":"あざみ野","x":139.553462,"y":35.568645},{"name":"江田","x":139.551518,"y":35.558671},{"name":"市が尾","x":139.541496,"y":35.551483},{"name":"藤が丘","x":139.527655,"y":35.543454},{"name":"青葉台","x":139.517376,"y":35.542855},{"name":"田奈","x":139.504855,"y":35.536204},{"name":"長津田","x":139.493548,"y":35.53196},{"name":"つくし野","x":139.485139,"y":35.527559},{"name":"すずかけ台","x":139.481684,"y":35.517094},{"name":"南町田グランベリーパーク","x":139.470318,"y":35.511502},{"name":"つきみ野","x":139.458651,"y":35.510546},{"name":"中央林間","x":139.444935,"y":35.507671}] } ,
	} ;

	export type line_cd = keyof typeof data ;
	export const lines = Object.entries ( data ) ;
}


namespace VM
{
	export class Applet
	{
		list1 = new List ( "TI" ) ;
	}

	export class List
	{
		public datasrc : DM.stat [] ;
		public compo : Compo < DM.stat [] > ;
		public renn ;
		public selected = new Key < DM.Order > () ;
		public hover = new Key < DM.Order > () ;
		public hoverInfo = Leaf.transR
		(
			this.hover.curr ,
			i => i && `${ i.target.no.$ }  ${ i.target.name.$ }` || ""
		) ;
		public focus = new Focus ;

		constructor ( line : keyof typeof DM.data )
		{
			const datasrc : DM.stat_src [] = DM.data [ line ].slist ;
			this.datasrc = datasrc.map ( ( src , n ) => DM.stat ( line , n , src ) ) ;
			this.compo = Compo ( this.datasrc ) ;
			this.renn = this.compo.renn ;
		}

		public fillLine ( line : DM.line_cd )
		{
			const data = DM.data [ line ] ;
			const vs : DM.stat [] = data.slist .map ( ( src , n ) => DM.stat ( line , n , src ) ) ;
			this.compo.insert ( vs , this.selected.curr.$?.$ ) ;
		}

		public createItem ( name : string )
		{
			const o = this.selected.curr.$ ;
			this.compo.insert ( [ DM.stat ( "X" , 0 , { name , x : 140 , y : 36 } ) ] , o ? o.$ + 1 : 0 ) ;
		}

		public deleteItem ()
		{
			const o = this.selected.curr.$ ;
			this.selected.set ( o ?.next ?? o ?.prev ) ;
			o && o.delete () ;
		}

		public clear ()
		{
			this.selected.set () ;
			this.renn.clear () ;
		}

		public item ( o : DM.Order ) : Item
		{
			return {
				SELECTED : this.selected.getItem ( o ) ,
				HOVER : this.hover.getItem ( o )
			} ;
		}
	}

	export type Item = { SELECTED : Match , HOVER : Match }
	type Match = Key.Match < DM.Order > ;
}

namespace VC
{
	const rootCSS = /* CSS */ `

		* { margin : 0 ; padding : 0 ; box-sizing : border-box ; }

		.FR { display : flex ; }
		.FC { display : flex ; flex-direction : column ; }
		.JC { justify-content : center ; }
		.AC { align-items : center ; }
		.FWR { flex-wrap : wrap ; }
		.PGMM { padding : 1em ; gap : 1em ; }
		.PGMX { padding : 1em ; gap : 1ex ; }
		.PGXX { padding : 1ex ; gap : 1ex ; }
` ;

	const css = /* css */ `

		.TEST { background : hsl( 90  60%  60% ) ; }

		.EDITOR {  }

		.LIST_EDITOR {  }

		.ITEM_EDITOR { display : none ; }
		.ITEM_EDITOR.SELECTED { display : grid ; }
		.ITEM_EDITOR ._NAME { padding : 0.1ex 0.3ex 0.2ex ; font-size : 1.6rem ; }

		.LIST
		{
			cursor : default ; background : hsl( 350  3%  95% ) ;
			padding : 1ex ;
		}
		.LIST ul { background : #fff ; width : 29em ; height : 30em ; overflow : auto ; }
		.LIST li
		{
			border-bottom : 1px dotted #ccc ;
			display : grid ; grid-template-columns : 5ex 6ex 13em 5ex 5ex ; gap : 1ex ;
		}
		.LIST li.HOVER { background : hsl( 210  0%  95% ) ; }
		.LIST li.SELECTED  { background : hsl( 210  90%  90% ) ; }
		.LIST li > * { text-align : center ; }
		.LIST .COUNT { border-radius : 0.2ex ; background : hsl( 95  40%  96% ) ; }

		.LIST2 { cursor : default ; display : flex ; gap : 0.5ex ; flex-wrap : wrap ; }
		.ITEM2 { min-width : 3.0ex ; border-radius : 0.30ex ;
			background : hsl( 0  0%  90% ) ; color : hsl( 0  0%  30% ) ; padding : 0.4ex  0.9ex ; }
		.ITEM2.HOVER { background : hsl( 225  90%  90% ) ; }
		.ITEM2.SELECTED { background : hsl( 225  0%  8% ) ;  color : hsl( 0  0%  80% ) ; }

		.HOVER_INFO { min-height : 4em ; }

		button { padding : 0.5ex 2em ; }
	` ;

	export const Applet = () =>
	{
		const vm = new VM.Applet ;

		const list = vm.list1 ;

		return ef.main
		(
			{ class : "FC AC PGMM" , shadow : [ rootCSS , css ] } ,
			// ef.h1 ( "Order Quest 1" ) ,
			LineFill ( list ) ,
			ef.section
			(
				{ class : "EDITOR  FR  PGXX" } ,
				ListEditor ( list ) ,
				pl.each ( list.renn , o => ItemEditor ( list , o ) ),
			) ,
			List ( list ) ,
			List2 ( list ) ,
			ef.p ( { class : "HOVER_INFO FR JC AC" } , list.hoverInfo ) ,
		)	
	}

	const LineFill = ( vm : VM.List ) => ef.section
	(
		{ class : "LINE_FILL FR JC PGXX FWR" } ,
		... DM.lines.map
		(
			( [ cd , data ] ) => ef.button ( { passive : { click () { vm.fillLine ( cd ) } } } , data.name )
		)
	) ;

	const ListEditor = ( vm : VM.List ) =>
	{
		return ef.section
		(
			{ class : "LIST_EDITOR  FC  PGXX" } ,
			Command ( "あとに作成" , () => vm.createItem ( "NEW" ) ) ,
			Command ( "削除" , () => vm.deleteItem () ) ,
			Command ( "全削除" , () => vm.clear () ) ,
			ef.p ( vm.renn.length )
		) ;
	}

	const Command = ( text : string , click : ( ev : MouseEvent ) => void ) => ef.button ( { passive : { click } } , text ) ;

	const ItemEditor = ( listVM : VM.List , o : DM.Order ) =>
	{
		const { SELECTED } = listVM.item ( o ) ;
		const data = o.target ;
		return ef.section
		(
			{ class : [ "ITEM_EDITOR" , { SELECTED } ] } ,
			ef.input ( { class : "_NAME" , biBind : { vChan : data.name } } ) ,
			ef.p ( data.y ) ,
			ef.p ( data.x ) ,
		) ;
	}

	const List = ( vm : VM.List ) => ef.ul
	(
		{
			class : "LIST" ,
			active :
			{
				click () { vm.selected.curr.$ = undefined ; } ,
				keydown ( ev )
				{
					switch ( ev.key )
					{
						case "Enter" :
						case "ArrowDown" : vm.selected.curr.$ = vm.renn.at ( 0 ) ; break ;
					}
				}
			} ,
			focus : vm.selected.getItem ( undefined ) ,
		} ,
		ef.ul
		(
			pl.each ( vm.renn , o => Item ( vm , o ) ) ,
		)
	) ;

	const Item = ( vm : VM.List , o : DM.Order ) =>
	{
		const { SELECTED , HOVER } = vm.item ( o ) ;
		const hook : DD.Hook < HTMLLIElement > = {} ;
		// Leaf.addRef ( HOVER , { vChan : () => hook.el ?.scrollIntoView ( { block : "nearest" } ) } ) ;
		return ef.li
		(
			{
				class : { SELECTED , HOVER } ,
				active :
				{
					click ( ev ) { vm.selected.set ( o ) ; ev.stopPropagation () ; } ,
					mouseenter () { vm.hover.set ( o ) ; } ,
					mouseleave () { vm.hover.set () ; },
				} ,
				focus : SELECTED ,
				hook ,
			} ,
			ef.span ( { class : "COUNT" } , o.count ) ,
			ef.span ( {  } , o.target.no ) ,
			ef.span ( { class : "NAME" } , o.target.name ) ,
			ef.span ( {  } , o.target.r1 ) ,
			ef.span ( {  } , o.target.r2 ) ,
		) ;
	}

	const List2 = ( vm : VM.List ) => ef.section
	(
		{ class : "LIST2" , focus : vm.selected.getItem ( undefined ) } ,
		pl.each ( vm.renn , o => Item2 ( vm , o ) ) ,
	) ;

	const Item2 = ( list : VM.List , o : DM.Order ) =>
	{
		const item = list.item ( o ) ;
		return ef.span
		(
			{
				class : [ "ITEM2" , item ] ,
				active :
				{
					click () { item.SELECTED.set () ; } ,
					mouseenter () { item.HOVER.set () ; } ,
				//	mouseleave () { item.HOVER.set ( false ) ; } ,
				} ,
				focus : item.SELECTED
			} ,
			o.target.no
		) ;
	}


}

{
	type xy = { x : number ; y : number ; } ;

	( x : Compo < xy [] > ) => { x ; }
}

export const OrderQ1 = VC.Applet ;
